//
//  AddCategory.swift
//  Bunjang
//
//  Created by 김민 on 2022/08/27.
//

import Foundation

struct CategoryCode {
    var categoryName: String
    var categoryCode: String
}

class AddCategory {
    
    //EA00 EA01 EB00 EB01 EB02 EC00 EC01
    var firstCategory = ["스타굿즈", "여성가방", "여성의류", "남성의류", "신발", "지역서비스", "원룸/함께살아요"]
    
    var secondCategory1 = ["보이그룹", "걸그룹", "솔로(남)", "솔로(여)", "배우(남)", "배우(여)", "방송/예능/캐릭터"]
    var secondCategory2 = ["클러치백", "솔더백", "크로스백", "도트백", "백팩", "기타(가방)"]
    var secondCategory3 = ["패딩/점퍼", "코트", "맨투맨", "후드티/후드집업", "티셔츠", "자켓"]
    var secondCategory4 = ["패딩/점퍼", "코트", "맨투맨", "후드티/후드집업", "티셔츠"]
    var secondCategory5 = ["스니커즈"]
    var secondCategory6 = ["이사/용달", "인테리어/간판", "청소/세탁/철거"]
    var secondCategory7 = ["주택/빌라", "원룸/투룸", "오피스텔", "아파트"]
    
    var secondCategory = [
            ["보이그룹", "걸그룹", "솔로(남)", "솔로(여)", "배우(남)", "배우(여)", "방송/예능/캐릭터"],
            ["클러치백", "솔더백", "크로스백", "도트백", "백팩", "기타(가방)"],
            ["패딩/점퍼", "코트", "맨투맨", "후드티/후드집업", "티셔츠", "자켓"],
            ["패딩/점퍼", "코트", "맨투맨", "후드티/후드집업", "티셔츠"],
            ["스니커즈"],
            ["이사/용달", "인테리어/간판", "청소/세탁/철거"],
            ["주택/빌라", "원룸/투룸", "오피스텔", "아파트"]
    ]
    
    var categoryFullName = [
            ["스타굿즈 > 보이그룹", "스타굿즈 > 걸그룹", "스타굿즈 > 솔로(남)", "스타굿즈 > 솔로(여)", "스타굿즈 > 배우(남)", "스타굿즈 > 배우(여)", "스타굿즈 > 방송/예능/캐릭터"],
            ["여성가방 > 클러치백", "여성가방 > 솔더백", "여성가방 > 크로스백", "여성가방 > 도트백", "여성가방 > 백팩", "여성가방 > 기타(가방)"],
            ["여성의류 > 패딩/점퍼", "여성의류 > 코트", "여성의류 > 맨투맨", "여성의류 > 후드티/후드집업", "여성의류 > 티셔츠", "여성의류 > 자켓"],
            ["남성의류 > 패딩/점퍼", "남성의류 > 코트", "남성의류 > 맨투맨", "남성의류 > 후드티/후드집업", "남성의류 > 티셔츠"],
            ["신발 > 스니커즈"],
            ["지역서비스 > 이사/용달", "지역서비스 > 인테리어/간판", "지역서비스 > 청소/세탁/철거"],
            ["원룸/함께살아요 > 주택/빌라", "원룸/함께살아요 > 원룸/투룸", "원룸/함께살아요 > 오피스텔", "원룸/함께살아요 > 아파트"]
    ]
    
    var categoryCode = [
        ["EA0000", "EA0001", "EA0002", "EA0003", "EA0004", "EA0005", "EA0006"],
        ["EA0100", "EA0101", "EA0102", "EA0103", "EA0104", "EA0105"],
        ["EB0000", "EB0001", "EB0002", "EB0003", "EB0004", "EB0005"],
        ["EB0100", "EB0101", "EB0102", "EB0103", "EB0104"],
        ["EB0205"],
        ["EC0000", "EC0001", "EC0002"],
        ["EC0100", "EC0101", "EC0102", "EC0103"]
    ]
}
